from PIL import Image
import os

cwd = os.getcwd()
path = os.path.join(cwd, "ocr")
directories = ["4luckpoker","5макс ребай","battle itc","bonuscraft","bonusworld","dozka","incubusk","pokerdom","telegram","wingamble",
    "анонимный нокаут","атака клонов мини","атака клонов","баунти сиеста","бекинг шоу","бородино","вечерний хайроллер","вечерний холдем",
    "возвращение джедая мини","возвращение джедая","возрождение феникса","гипер пко","дикий карась","динамическая прогрессия","дипстек рибай",
    "дневной охотник","мультифрибай","застенчивый амур","золотой феникс","мегабаунти","месть ситхов мини","месть ситхов","мини феникс мегастек",
    "минибаунти","мультибаунти","новая надежда","нокаут марлы сингер","нокаут суперстек","нокаут тайлера дердена","ночной охотник",
    "одноглазый лосось","озорная щучка","первое правило пко","полет феникса","полосатый окунь","полуночный экспресс","последние джедаи мини",
    "последние джедаи","премиум холдем","призрачный феникс","пробуждение силы мини","пробуждение силы","пробуждение феникса","прогрессивный нокаут",
    "радужная форель","ребай мания","большой взрыв","сказочный феникс","скрытая угроза мини","скрытая угроза","спортивный понедельник",
    "сумрачный карп","супер баунти","супер нокаут","супер прогрессивный нокаут","темный феникс турбо","турбо дипстек","турбо нокаут",
    "турбо суперстек","утренний турбо дипстек","феникс в пути","феникс мегастек","блефач","o_poker","супер воскресенье","супер вторник","супер пятница",
    "холдем нокаут","ярость феникса мини","ярость феникса"]


"""
for item in directories: 
    directory = os.path.join(path, item)
    os.mkdir(directory)
print(os.listdir(path))

filename = 'ocr/test.png'
with Image.open(filename) as im:
    print("Размер изображения:")  
    print(im.format, im.size, im.mode)

    box = (800, 360, 1280, 800)
    crop  = im.crop(box)
    crop.show()
    crop.save("ocr/crop_test.png")
"""